_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
input_1 (InputLayer)         (None, 1280)              0
_________________________________________________________________
dense_1 (Dense)              (None, 128)               163968
_________________________________________________________________
batch_normalization_1 (Batch (None, 128)               512
_________________________________________________________________
activation_1 (Activation)    (None, 128)               0
_________________________________________________________________
dense_2 (Dense)              (None, 128)               16512
_________________________________________________________________
batch_normalization_2 (Batch (None, 128)               512
_________________________________________________________________
activation_2 (Activation)    (None, 128)               0
_________________________________________________________________
dense_3 (Dense)              (None, 128)               16512
_________________________________________________________________
batch_normalization_3 (Batch (None, 128)               512
_________________________________________________________________
activation_3 (Activation)    (None, 128)               0
_________________________________________________________________
dense_4 (Dense)              (None, 128)               16512
_________________________________________________________________
batch_normalization_4 (Batch (None, 128)               512
_________________________________________________________________
activation_4 (Activation)    (None, 128)               0
_________________________________________________________________
dense_5 (Dense)              (None, 8)                 1032
_________________________________________________________________
batch_normalization_5 (Batch (None, 8)                 32
_________________________________________________________________
activation_5 (Activation)    (None, 8)                 0
_________________________________________________________________
dense_6 (Dense)              (None, 128)               1152
_________________________________________________________________
batch_normalization_6 (Batch (None, 128)               512
_________________________________________________________________
activation_6 (Activation)    (None, 128)               0
_________________________________________________________________
dense_7 (Dense)              (None, 128)               16512
_________________________________________________________________
batch_normalization_7 (Batch (None, 128)               512
_________________________________________________________________
activation_7 (Activation)    (None, 128)               0
_________________________________________________________________
dense_8 (Dense)              (None, 128)               16512
_________________________________________________________________
batch_normalization_8 (Batch (None, 128)               512
_________________________________________________________________
activation_8 (Activation)    (None, 128)               0
_________________________________________________________________
dense_9 (Dense)              (None, 128)               16512
_________________________________________________________________
batch_normalization_9 (Batch (None, 128)               512
_________________________________________________________________
activation_9 (Activation)    (None, 128)               0
_________________________________________________________________
dense_10 (Dense)             (None, 1280)              165120
=================================================================
Total params: 434,472
Trainable params: 432,408
Non-trainable params: 2,064
