_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
input_1 (InputLayer)         (None, 1280)              0
_________________________________________________________________
dense_1 (Dense)              (None, 128)               163968
_________________________________________________________________
batch_normalization_1 (Batch (None, 128)               512
_________________________________________________________________
activation_1 (Activation)    (None, 128)               0
_________________________________________________________________
dense_2 (Dense)              (None, 64)                8256
_________________________________________________________________
batch_normalization_2 (Batch (None, 64)                256
_________________________________________________________________
activation_2 (Activation)    (None, 64)                0
_________________________________________________________________
dense_3 (Dense)              (None, 32)                2080
_________________________________________________________________
batch_normalization_3 (Batch (None, 32)                128
_________________________________________________________________
activation_3 (Activation)    (None, 32)                0
_________________________________________________________________
dense_4 (Dense)              (None, 16)                528
_________________________________________________________________
batch_normalization_4 (Batch (None, 16)                64
_________________________________________________________________
activation_4 (Activation)    (None, 16)                0
_________________________________________________________________
dense_5 (Dense)              (None, 16)                272
_________________________________________________________________
batch_normalization_5 (Batch (None, 16)                64
_________________________________________________________________
activation_5 (Activation)    (None, 16)                0
_________________________________________________________________
dense_6 (Dense)              (None, 128)               2176
_________________________________________________________________
batch_normalization_6 (Batch (None, 128)               512
_________________________________________________________________
activation_6 (Activation)    (None, 128)               0
_________________________________________________________________
dense_7 (Dense)              (None, 128)               16512
_________________________________________________________________
batch_normalization_7 (Batch (None, 128)               512
_________________________________________________________________
activation_7 (Activation)    (None, 128)               0
_________________________________________________________________
dense_8 (Dense)              (None, 128)               16512
_________________________________________________________________
batch_normalization_8 (Batch (None, 128)               512
_________________________________________________________________
activation_8 (Activation)    (None, 128)               0
_________________________________________________________________
dense_9 (Dense)              (None, 128)               16512
_________________________________________________________________
batch_normalization_9 (Batch (None, 128)               512
_________________________________________________________________
activation_9 (Activation)    (None, 128)               0
_________________________________________________________________
dense_10 (Dense)             (None, 1280)              165120
=================================================================
Total params: 395,008
Trainable params: 393,472
Non-trainable params: 1,536
